.planning/case_profiles/case_028_apu_bay_ventilation_dicts/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }

// Air at 20°C · incompressible Newtonian
transportModel  Newtonian;
nu              1.5e-05;    // kinematic viscosity m²/s (air @ 293 K)
