.planning/case_profiles/case_028_apu_bay_ventilation_dicts/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object omega; }

// case_028 ventilation · specific dissipation
// omega = sqrt(k) / (C_mu^0.25 · L) = sqrt(0.09375) / (0.09^0.25 · 0.3) ≈ 1.87 1/s
// L = 0.1 × bay characteristic dim ≈ 0.3 m (10% of 3 m bay depth)

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1.87;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.87;
    }
    outlet
    {
        type            zeroGradient;
    }
    bay_top
    {
        type            slip;
    }
    bay_bottom
    {
        type            slip;
    }
    bay_side_p
    {
        type            slip;
    }
    bay_side_n
    {
        type            slip;
    }
    "(Outer_Surf|Inner_Surf|Plane_Outer_Surf|intake_duct|vent_door|door|plenum|exhaust_pipe_1|exhaust_section|bleed_air_pipe|ejector|gearbox_.*|compressor|load_compressor|load_volute|combustion_chamber|fuel_valve|firewall_.*|Frame_.*|beam_.*)"
    {
        type            omegaWallFunction;
        value           uniform 1.87;
    }
}
