.planning/case_profiles/case_028_apu_bay_ventilation_dicts/system/decomposeParDict
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }

numberOfSubdomains 4;
method          simple;

simpleCoeffs
{
    n           (2 2 1);
    delta       0.001;
}

distributed     no;
